5.org
#+TITLE: Lisp文件
#+SETUPFILE: ./resource/template.org

* 在本章：
*创建Lisp文件*
*加载文件*
*编译文件*
*eval-after-load*
*局部变量列表*
*补充：安全考虑*

到目前为止，我们编写的大多数Emacs Lisp都可以放进你的.emacs文件里。一种替代的方案是将Emacs Lisp的代码根据功能放进不同的文件里。这需要更多的努力，但是这同样也比把代码直接放到.emacs里多了一些好处：

+ .emacs中的代码在Emacs启动时总是会执行，即使我们在当前的工作中可能根本不需要它。这会使启动时间延长并且会消耗内存。相反的，分离的Lisp文件只有在我们需要的时候才去载入它。
+ .emacs中的代码通常并不会进行字节编译（byte-compiled）。字节编译会将Emacs Lisp转换成载入更高效、执行更快并且使用更少内存的格式（就像其他语言的程序一样，这会将代码变成不适于程序员阅读的格式）。字节编译过的Lisp文件通常以.elc（“Emacs Lisp, compiled”）作为后缀名，而未进行编译的文件通常以.el（“Emacs Lisp”）后缀。
+ 将所有代码放到.emacs里将会使文件膨胀成难以管理的乱麻。
  
前面章节所编写的代码就是这种可以根据功能划分到不同Lisp文件中的很好的例子，它们只应该在需要的时候载入，并且应该进行字节编译以提高执行效率。

* 创建Lisp文件
Emacs Lisp文件名通常以.el为后缀，所以作为开始，让我们创建timestamp.el并且将上一章中最后完成的代码放进去，如下所示。
#+BEGIN_SRC emacs-lisp
  (defvar insert-time-format ...)
  (defvar insert-date-format ...)
  (defun insert-time () ...)
  (defun insert-date () ...)
  (defvar writestamp-format ...)
  (defvar writestamp-prefix ...)
  (defvar writestamp-suffix ...)
  (defun update-writestamps () ...)
  (defvar last-change-time ...)
  (make-variable-buffer-local 'last-change-time)
  (defun remember-change-time ...)
  (defvar modifystamp-format ...)
  (defvar modifystamp-prefix ...)
  (defvar modifystamp-suffix ...)
  (defun maybe-update-modifystamps () ...)
  (defun update-modifystamps (time) ...)
#+END_SRC

先不要加入add-hook和make-local-hook。我们后面再来关注他们。现在，你需要注意的是当编写Lisp文件的时候，它应该能在任意时机被加载，甚至加载多次，而并不会带来你不希望的副作用。一个这种副作用的例子是，假如你不希望当前buffer的after-change-functions变为局部变量，而又把(make-local-hook 'after-change-functions)加入了到timestamp.el中。

* 加载文件
当把代码写入到timestamp.el中后，我们必须进行配置，以使我们在需要的时候能够正确的访问到它们。这是通过加载（loading）完成的，也就是使Emacs读取和执行它的内容。在Emacs中有许多方式来加载Lisp文件：交互式的（interactively）、非交互式的（non-interactively）、明确的（explicitly）、模糊的（implicitly）、以及使用或者不使用路径搜索（pathsearching）的。

** 找到Lisp文件
Emacs能够根据像/usr/local/share/emacs/site-lisp/foo.el这样的绝对路径来加载文件，但是通常更为方便的方式是直接使用如bo.el这样的文件名，而让Emacs在加载路径（load path）中去找到它。加载路径简单来说就是Emacs用来搜索要加载的文件的目录列表，跟UNIX shell中使用环境变量PATH来找到要执行的程序相似。Emacs的加载路径储存在一个字符串列表变量load-path里。

当Emacs启动的时候，load-path的初始设置大概看起来跟这个差不多：
#+BEGIN_SRC emacs-lisp
  ("/usr/local/share/emacs/19.34/site-lisp"
   "/usr/local/share/emacs/site-lisp"
   "/usr/local/share/emacs/19.34/lisp")
#+END_SRC

搜索路径时的顺序与其在列表中出现的顺序相同。要在load-path的头部加入一个路径，在你的.emacs文件中加入下面的代码：
#+BEGIN_SRC emacs-lisp
  (setq load-path
        (cons "/your/directory/here"
              load-path))
#+END_SRC

要在其末尾加入，则使用：
#+BEGIN_SRC emacs-lisp
  (setq load-path
        (append load-path
                '("/your/directory/here")))
#+END_SRC

注意到在第一个例子中，“/your/directory/here”只作为一个普通字符串，而在第二个例子中，它却出现在一个括起来的列表中。[[file:6.org][第六章]]将会解释Lisp中各种处理列表的方式。

如果你要求Emacs在加载路径中查找一个Lisp文件并且忽略掉后缀名的话--例如你使用foo而不是foo.el--Emacs会首先查找fool.elc，也就是foo.el的字节编译格式。如果找不到，那么它将会尝试foo.el，最后是foo。通常加载文件时最好忽略掉后缀名。因为这样不仅会使你得到更有效的查找行为，而且这还会让eval-after-load工作的更好（阅读本章后面的[[eval-after-load][eval-after-load]]章节获得更多信息）。

** 交互式加载
有两个Emacs命令用来交互式的加载Lisp文件：load-file和load-library。当你输入M-x load-file RET时，Emacs会提示你输入一个Lisp文件的绝对路径（例如/home/bobg/emacs/foo.el）而不去搜索load-path。这会使用通常的文件名提示方法，所以文件名会进行自动补全。而另一种方式，当你输入M-x load-library RET时，Emacs将会提示你输入库的基本名称（例如foo）并且尝试在load-path中找到它。这不会使用文件名提示方法，因此也就不会进行自动补全。

** 以代码加载
当在Lisp代码中加载文件时，你可以选择显式加载、条件加载或者自动加载。
*** 显式加载
可以显式的调用load（和交互式加载中的load-library行为类似）或者load-file加载文件。
#+BEGIN_SRC emacs-lisp
  (load "lazy-lock")
#+END_SRC

会搜索load-path来查找lazy-lock.elc、lazy-lock.el或者lazy-lock。
#+BEGIN_SRC emacs-lisp
  (load-file "/home/bobg/emacs/lazy-lock.elc")
#+END_SRC

将不会使用load-path。

显式加载应该在你确定需要马上加载某个文件时才使用，并且你应该确信文件并没有加载过或者你并不关心。事实上，如果使用下面的替代方式，你基本上不会用到显式加载这种方式。

