html/5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-08 Thu 10:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp文件</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Lisp文件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcc36748">1. 在本章：</a></li>
<li><a href="#org7d48b07">2. 创建Lisp文件</a></li>
<li><a href="#org549e2d3">3. 加载文件</a>
<ul>
<li><a href="#org7e6431a">3.1. 找到Lisp文件</a></li>
<li><a href="#org2bb29c2">3.2. 交互式加载</a></li>
<li><a href="#org61f6b1f">3.3. 以代码加载</a>
<ul>
<li><a href="#orgb9f4a0f">3.3.1. 显式加载</a></li>
<li><a href="#org03170f0">3.3.2. 条件加载</a></li>
<li><a href="#org19a8601">3.3.3. 自动加载</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1819f38">4. 编译文件</a></li>
<li><a href="#orgf4a4190">5. eval-after-load</a></li>
<li><a href="#org37ba359">6. 局部变量列表</a></li>
<li><a href="#org18a5363">7. 补充：安全考虑</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcc36748" class="outline-2">
<h2 id="orgcc36748"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>创建Lisp文件</b><br />
<b>加载文件</b><br />
<b>编译文件</b><br />
<b>eval-after-load</b><br />
<b>局部变量列表</b><br />
<b>补充：安全考虑</b><br />
</p>

<p>
到目前为止，我们编写的大多数Emacs Lisp都可以放进你的.emacs文件里。一种替代的方案是将Emacs Lisp的代码根据功能放进不同的文件里。这需要更多的努力，但是这同样也比把代码直接放到.emacs里多了一些好处：<br />
</p>

<ul class="org-ul">
<li>.emacs中的代码在Emacs启动时总是会执行，即使我们在当前的工作中可能根本不需要它。这会使启动时间延长并且会消耗内存。相反的，分离的Lisp文件只有在我们需要的时候才去载入它。<br /></li>
<li>.emacs中的代码通常并不会进行字节编译（byte-compiled）。字节编译会将Emacs Lisp转换成载入更高效、执行更快并且使用更少内存的格式（就像其他语言的程序一样，这会将代码变成不适于程序员阅读的格式）。字节编译过的Lisp文件通常以.elc（“Emacs Lisp, compiled”）作为后缀名，而未进行编译的文件通常以.el（“Emacs Lisp”）后缀。<br /></li>
<li>将所有代码放到.emacs里将会使文件膨胀成难以管理的乱麻。<br /></li>
</ul>

<p>
前面章节所编写的代码就是这种可以根据功能划分到不同Lisp文件中的很好的例子，它们只应该在需要的时候载入，并且应该进行字节编译以提高执行效率。<br />
</p>
</div>
</div>

<div id="outline-container-org7d48b07" class="outline-2">
<h2 id="org7d48b07"><span class="section-number-2">2</span> 创建Lisp文件</h2>
<div class="outline-text-2" id="text-2">
<p>
Emacs Lisp文件名通常以.el为后缀，所以作为开始，让我们创建timestamp.el并且将上一章中最后完成的代码放进去，如下所示。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">insert-time-format</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">insert-date-format</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">insert-time</span> <span style="color: #66D9EF;">()</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">insert-date</span> <span style="color: #66D9EF;">()</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">writestamp-format</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">writestamp-prefix</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">writestamp-suffix</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">update-writestamps</span> <span style="color: #66D9EF;">()</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">last-change-time</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>make-variable-buffer-local 'last-change-time<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">remember-change-time</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">modifystamp-format</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">modifystamp-prefix</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">modifystamp-suffix</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">maybe-update-modifystamps</span> <span style="color: #66D9EF;">()</span> ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">update-modifystamps</span> <span style="color: #66D9EF;">(</span>time<span style="color: #66D9EF;">)</span> ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
先不要加入add-hook和make-local-hook。我们后面再来关注他们。现在，你需要注意的是当编写Lisp文件的时候，它应该能在任意时机被加载，甚至加载多次，而并不会带来你不希望的副作用。一个这种副作用的例子是，假如你不希望当前buffer的after-change-functions变为局部变量，而又把(make-local-hook 'after-change-functions)加入了到timestamp.el中。<br />
</p>
</div>
</div>

<div id="outline-container-org549e2d3" class="outline-2">
<h2 id="org549e2d3"><span class="section-number-2">3</span> 加载文件</h2>
<div class="outline-text-2" id="text-3">
<p>
当把代码写入到timestamp.el中后，我们必须进行配置，以使我们在需要的时候能够正确的访问到它们。这是通过加载（loading）完成的，也就是使Emacs读取和执行它的内容。在Emacs中有许多方式来加载Lisp文件：交互式的（interactively）、非交互式的（non-interactively）、明确的（explicitly）、模糊的（implicitly）、以及使用或者不使用路径搜索（pathsearching）的。<br />
</p>
</div>

<div id="outline-container-org7e6431a" class="outline-3">
<h3 id="org7e6431a"><span class="section-number-3">3.1</span> 找到Lisp文件</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Emacs能够根据像/usr/local/share/emacs/site-lisp/foo.el这样的绝对路径来加载文件，但是通常更为方便的方式是直接使用如bo.el这样的文件名，而让Emacs在加载路径（load path）中去找到它。加载路径简单来说就是Emacs用来搜索要加载的文件的目录列表，跟UNIX shell中使用环境变量PATH来找到要执行的程序相似。Emacs的加载路径储存在一个字符串列表变量load-path里。<br />
</p>

<p>
当Emacs启动的时候，load-path的初始设置大概看起来跟这个差不多：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"/usr/local/share/emacs/19.34/site-lisp"</span>
 <span style="color: #E6DB74;">"/usr/local/share/emacs/site-lisp"</span>
 <span style="color: #E6DB74;">"/usr/local/share/emacs/19.34/lisp"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
搜索路径时的顺序与其在列表中出现的顺序相同。要在load-path的头部加入一个路径，在你的.emacs文件中加入下面的代码：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> load-path
      <span style="color: #66D9EF;">(</span>cons <span style="color: #E6DB74;">"/your/directory/here"</span>
            load-path<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
要在其末尾加入，则使用：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> load-path
      <span style="color: #66D9EF;">(</span>append load-path
              '<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"/your/directory/here"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
注意到在第一个例子中，“/your/directory/here”只作为一个普通字符串，而在第二个例子中，它却出现在一个括起来的列表中。<a href="6.html">第六章</a>将会解释Lisp中各种处理列表的方式。<br />
</p>

<p>
如果你要求Emacs在加载路径中查找一个Lisp文件并且忽略掉后缀名的话&#x2013;例如你使用foo而不是foo.el&#x2013;Emacs会首先查找fool.elc，也就是foo.el的字节编译格式。如果找不到，那么它将会尝试foo.el，最后是foo。通常加载文件时最好忽略掉后缀名。因为这样不仅会使你得到更有效的查找行为，而且这还会让eval-after-load工作的更好（阅读本章后面的<a href="#orgf4a4190">eval-after-load</a>章节获得更多信息）。<br />
</p>
</div>
</div>

<div id="outline-container-org2bb29c2" class="outline-3">
<h3 id="org2bb29c2"><span class="section-number-3">3.2</span> 交互式加载</h3>
<div class="outline-text-3" id="text-3-2">
<p>
有两个Emacs命令用来交互式的加载Lisp文件：load-file和load-library。当你输入M-x load-file RET时，Emacs会提示你输入一个Lisp文件的绝对路径（例如/home/bobg/emacs/foo.el）而不去搜索load-path。这会使用通常的文件名提示方法，所以文件名会进行自动补全。而另一种方式，当你输入M-x load-library RET时，Emacs将会提示你输入库的基本名称（例如foo）并且尝试在load-path中找到它。这不会使用文件名提示方法，因此也就不会进行自动补全。<br />
</p>
</div>
</div>

<div id="outline-container-org61f6b1f" class="outline-3">
<h3 id="org61f6b1f"><span class="section-number-3">3.3</span> 以代码加载</h3>
<div class="outline-text-3" id="text-3-3">
<p>
当在Lisp代码中加载文件时，你可以选择显式加载、条件加载或者自动加载。<br />
</p>
</div>
<div id="outline-container-orgb9f4a0f" class="outline-4">
<h4 id="orgb9f4a0f"><span class="section-number-4">3.3.1</span> 显式加载</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
可以显式的调用load（和交互式加载中的load-library行为类似）或者load-file加载文件。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>load <span style="color: #E6DB74;">"lazy-lock"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
会搜索load-path来查找lazy-lock.elc、lazy-lock.el或者lazy-lock。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>load-file <span style="color: #E6DB74;">"/home/bobg/emacs/lazy-lock.elc"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
将不会使用load-path。<br />
</p>

<p>
显式加载应该在你确定需要马上加载某个文件时才使用，并且你应该确信文件并没有加载过或者你并不关心。事实上，如果使用下面的替代方式，你基本上不会用到显式加载这种方式。<br />
</p>
</div>
</div>
