html/5.html

<div id="outline-container-org03170f0" class="outline-4">
<h4 id="org03170f0"><span class="section-number-4">3.3.2</span> 条件加载</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
当n处不同的Lisp代码想要载入同一个文件时，有两个Emacs Lisp函数，即require和provide，给出了一种方法来确保文件只会被加载一次而不是n次。<br />
</p>

<p>
一个Lisp文件通常包含着一系列相关的函数。我们可以认为这些函数是一个单独的特性（feature）。加载这个文件会使得其包含的特性可用。<br />
</p>

<p>
Emacs明确了特性这个概念。特性通过Lisp符号进行命名，使用provide进行声明，使用require进行请求。<br />
</p>

<p>
它是这么工作的。首先，我们为timestamp.el提供的特性来选择一个代表的符号。让我们使用一个明显的，timestamp。我们通过在timestamp.el中写入<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">provide</span> '<span style="color: #AE81FF;">timestamp</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
来表明timestamp.el提供了特性timestamp。通常它出现在文件的末尾，这样只有当前面所有语句都正确执行后，这个特性才会被标识为“provided”。(如果发生了什么异常，那么文件的加载将会在调用provide之前终止)。<br />
</p>

<p>
现在假设在某处的代码需要使用时间戳功能。使用require：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">timestamp</span> <span style="color: #E6DB74;">"timestamp"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这表示，“如果timestamp特性还不可用，那么加载timestamp”（这会使用load，并且会搜索load-path）。如果timestamp特性已经提供了（也就是timestamp之前已经加载了），那么什么都不做。<br />
</p>

<p>
通常，对于require的调用通常都出现在Lisp文件的头部&#x2013;就像C程序中通常以一大堆#includes开头一样。但是有些程序员喜欢在需要某个特性时才在那里调用require。这可能有很多个地方，而如果每次都会真的去加载文件的话，程序将会慢的像爬，每载入一个文件都会耗费大量的时间。使用“特性”将会使得文件只载入一次，大量的节省时间！<br />
</p>

<p>
调用require时，如果文件名是特性名的“字符串等价式”，那么文件名可以被省略而根据特性名推断出来。符号的“字符串等价式”就是简单的符号名称的字符串格式。特性符号timestamp的字符串等价式为“timestamp”，所以我们可以这么写：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">timestamp</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
来替换(require 'timestamp "timestamp")。（函数symbol-name可以得到符号的字符串等价式）。<br />
</p>

<p>
如果require使得相关的文件被加载（这时其特性还未被提供），那么那个文件应该provide请求的特性。否则，require将会报告加载的文件并没有提供需要的特性。<br />
</p>
</div>
</div>

<div id="outline-container-org19a8601" class="outline-4">
<h4 id="org19a8601"><span class="section-number-4">3.3.3</span> 自动加载</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
当使用自动加载（autoloading）时，你可以推迟一个文件的加载直到它必须加载的时候&#x2013;也就是直到你调用了它里面的方法。设置自动加载代价很小，因此通常都是在.emacs文件里做。<br />
</p>

<p>
函数autoload将一个函数名称与一个定义它的文件联系在一起。当Emacs尝试调用一个还未被定义的函数时，它将根据autoload来载入指定的文件，并且假定它做出了定义。而不使用autoload，尝试执行一个未定义的函数将会报错。<br />
</p>

<p>
下面是如何使用：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>autoload 'insert-time <span style="color: #E6DB74;">"timestamp"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'insert-date <span style="color: #E6DB74;">"timestamp"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-writestamps <span style="color: #E6DB74;">"timestamp"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-modifystamps <span style="color: #E6DB74;">"timestamp"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
当第一次调用这四个函数insert-time，insert-date，updatewritestamps，或者update-modifystamps中的任意一个时，Emacs都将加载timestamp。这不仅会载入被调用的函数定义，并且会使另外的三个也被载入，所以后续的对于这几个函数的调用不会重新载入timestamp。<br />
</p>

<p>
autoload函数有多个可选参数。第一个参数是文档字符串。文档字符串允许用户甚至在还未从文件中加载函数的定义之前就得到帮助（通过describe-function和apropos）。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>autoload 'insert-time <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Insert the current time according to insert-time-format."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'insert-date <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Insert the current date according to insert-date-format."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-writestamps <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Find writestamps and replace them with the current time."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-modifystamps <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Find modifystamps and replace them with the given time."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
下一个可选参数定义了当函数被加载后是一个交互式命令还是一个普通函数。如果忽略或者为nil，函数将被认为是非交互的；否则它就是一个命令。函数被加载之前，像command-apropos这样的函数也可以使用这个信息来区分函数是交互式还是非交互式的。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>autoload 'insert-time <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Insert the current time according to insert-time-format."</span>
  t<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'insert-date <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Insert the current date according to insert-date-format."</span>
  t<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-writestamps <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Find writestamps and replace them with the current time."</span>
  nil<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>autoload 'update-modifystamps <span style="color: #E6DB74;">"timestamp"</span>
  <span style="color: #75715E;">"Find modifystamps and replace them with the given time."</span>
  nil<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
如果你在autoload中错误的将交互式函数标记为非交互的，或者相反，当函数被载入之后就不要紧了。真正的函数定义会将所有autoload所给出的信息替换掉。<br />
</p>

<p>
最后一个可选参数我们这里不会讲。如果自动加载对象的类型不是函数的话，它会指定类型。就像它所指出的，键映射表和宏（我们后面的章节将会讲到）也可以被自动加载。<br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1819f38" class="outline-2">
<h2 id="org1819f38"><span class="section-number-2">4</span> 编译文件</h2>
<div class="outline-text-2" id="text-4">
<p>
就像在本章开始所提到的，当我们将Lisp代码储存在各自的文件里之后，我们可以对它进行字节编译（byte-compile）。字节编译将Emacs Lisp转换成更紧凑、执行更快的格式。就像在其他编程语言中的编译一样，程序员很难阅读字节编译的结果。但不像其他的编译，字节编译的结果在不同硬件平台和操作系统上是可移植的（但可能不兼容老版本的Emacs）。<br />
</p>

<p>
字节编译过的Lisp代码比未编译的代码执行速度快很多。<br />
</p>

<p>
字节编译的Lisp文件后缀名为.elc文件。就像前面提到的，不使用后缀名调用load和load-library将会优先加载.elc文件而不是.el文件。<br />
</p>

<p>
有几种字节编译文件的方式。最直接的方式是<br />
</p>

<ul class="org-ul">
<li>在Emacs里：执行M-x byte-compile-file RET file.el RET。<br /></li>
<li>在UNIX shell里：执行emacs -batch -f batch-byte-compile file.el。<br /></li>
</ul>

<p>
你可以对Lisp文件的路径执行byte-recompile-directory来进行字节编译。<br />
</p>

<p>
当Emacs要载入的.elc文件的日期比对应的.el文件的日期旧时，Emacs将仍然会载入它，但是会提示一个警告。<br />
</p>
</div>
</div>

<div id="outline-container-orgf4a4190" class="outline-2">
<h2 id="orgf4a4190"><span class="section-number-2">5</span> eval-after-load</h2>
<div class="outline-text-2" id="text-5">
<p>
如果你希望直到某个特定文件加载之后才执行某些代码，eval-after-load就是你需要的。例如，假如你搞出了一个比dired（Emacs的目录编辑模块）自身的dired-sort-toggle更好的函数定义。你不能简单的把它放入.emacs中，因为一旦你编辑一个目录，dired将会被自动加载，而这将会把你自己的定义替换掉。<br />
</p>

<p>
你应该做的是：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>eval-after-load
    <span style="color: #E6DB74;">"dired"</span>
  '<span style="color: #66D9EF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">dired-sort-toggle</span> <span style="color: #A6E22E;">()</span>
     ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这将会在dired加载之后马上执行defun，将dired自己的dired-sort-toggle替换为其他的版本。但是要注意，这只有当使用dired这个名称加载时才会工作。如果使用名称dired.elc或者/usr/local/share/emacs/19.34/lisp/dired加载dired的话就不会执行。load或者autoload或者require必须使用同eval-after-load中一模一样的名称才可以。这也就是前面提到的为什么最好只用文件的基本名称加载文件的原因。<br />
</p>

<p>
eval-after-load的另一个作用是当你希望在一个包中使用某个变量、函数或者按键映射，而你又不想强制这个包加载的时候：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>eval-after-load
    <span style="color: #E6DB74;">"font-lock"</span>
  '<span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> lisp-font-lock-keywords lisp-font-lock-keywords-2<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这里使用了font-lock定义的变量lisp-font-lock-keywords-2。如果你在fontlock加载之前使用lisp-font-lock-keywords-2，你将会得到一个“Symbol's value as variable is void”错误。但是不要急着加载font-lock，因为这个setq只是为了将lisp-font-lock-keywords-2设置给font-lock的另一个变量lisp-font-lock-keywords，而这只有当font-lock由于什么原因加载的时候才会用到。所以我们使用eval-after-load来保证setq不会发生的太早而引起错误。<br />
</p>

<p>
如果你调用eval-after-load而文件已经被加载会发生什么呢？那么后面的Lisp表达式会马上执行。如果同一个文件有多个eval-after-load会发生什么呢？它们会在文件加载时一个接一个的全部执行。<br />
</p>

<p>
你可能发现eval-after-load的工作方式和钩子变量很相似。这是对的，但是一个重要的区别是钩子只执行Lisp函数（通常为lambda表达式的形式），而eval-after-load可以执行任何Lisp表达式。<br />
</p>
</div>
</div>
