html/5.html

<div id="outline-container-org37ba359" class="outline-2">
<h2 id="org37ba359"><span class="section-number-2">6</span> 局部变量列表</h2>
<div class="outline-text-2" id="text-6">
<p>
本章前面的内容已经足够创建并且根据需要加载Lisp代码文件了。但是对于timestamp的例子，事情还是有些不同。当调用update-writestamps时会自动载入timestamp，但是谁来调用update-writestamps并且加载timestamp呢？回想一下前一章中update-writestamps是由local-write-file-hooks调用的。那么如何将update-writestamps放进local-write-file-hooks里呢？而因为前面的章节<a href="#org7d48b07">2</a>中所提到的副作用，我们一定不能在加载文件时这么做。<br />
</p>

<p>
我们需要一种方法将update-writestmpas加入到需要它的buffer的局部变量local-write-file-hooks里，这样当local-write-file-hooks第一次触发时就会自动加载timestamp。<br />
</p>

<p>
一种很好的完成这个需求的手段是使用文件尾部的局部变量列表（local variables list）。当Emacs访问一个新文件的时候，它会扫描文件的尾部是否有这样的文本块[<a href="#orge569989">22</a>]：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">Local Variables&#58;
var1: value1
var2: value2
...
End:
</pre>
</div>

<p>
当Emacs找到这样一个块的时候，它会将每个value赋给对应的var，并且使其变为buffer的局部变量。Emacs甚至能解析出以某个前缀开头的这种块，只要它们的前缀相同。而在Lisp代码文件中必须将其作为注释，这样它们就不会被当做是Lisp代码执行：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #75715E;">; </span><span style="color: #75715E;">Local Variables&#58;</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">var1: value1</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">var2: value2</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">...</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">End:</span>
</pre>
</div>

<p>
values被当做引用来对待；它们在赋给对应的vars之前不会被计算。所以在包含下面这个块<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #75715E;">; </span><span style="color: #75715E;">Local Variables&#58;</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">foo: (+ 3 5)</span>
<span style="color: #75715E;">; </span><span style="color: #75715E;">End:</span>
</pre>
</div>

<p>
的文件中buffer局部变量foo的值为(+ 3 5)，而不是8。<br />
</p>

<p>
因此任何需要将update-writestamps加入到local-write-file-hooks中的文件都可以这样指定：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">Local Variables&#58;
local-write-file-hooks: <span style="color: #AE81FF;">(</span>update-writestamps<span style="color: #AE81FF;">)</span>
End:
</pre>
</div>

<p>
实际上，文件可以根据需要建立起自己所有的变量：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">Local Variables&#58;
local-write-file-hooks: <span style="color: #AE81FF;">(</span>update-writestamps<span style="color: #AE81FF;">)</span>
writestamp-prefix: <span style="color: #E6DB74;">"Written:"</span>
writestamp-suffix: <span style="color: #E6DB74;">"."</span>
writestamp-format: <span style="color: #E6DB74;">"%D"</span>
End:
</pre>
</div>

<p>
使用这种方式设置local-write-file-hooks的一个问题是它会将local-write-file-hooks替换为上面例子中所示的一个新的列表，而不是一种更好的方式&#x2013;保留原来local-write-file-hooks里的其他值并向其中添加update-writestamps。虽然这样做需要执行Lisp代码。即，你需要执行下面的表达式：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'local-write-file-hooks 'update-writestamps<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Emacs在局部变量列表中引入一个“伪变量（pseudovariable）”eval来完成这个功能。<br />
当<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">eval: value
</pre>
</div>

<p>
出现在局部变量列表中时，value将被计算。计算的结果将被忽略；它将不会存储到局部变量eval中。因此完整的解决方案是将<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">eval: <span style="color: #AE81FF;">(</span>add-hook 'local-write-file-hooks 'update-writestamps<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
添加到局部变量里。<br />
</p>

<p>
实际上，设置local-write-file-hooks的正确做法应该是编写一个子模式（minor mode），这将是<a href="7.html">第7章</a>的主题。<br />
</p>
</div>
</div>

<div id="outline-container-org18a5363" class="outline-2">
<h2 id="org18a5363"><span class="section-number-2">7</span> 补充：安全考虑</h2>
<div class="outline-text-2" id="text-7">
<p>
局部变量列表是一个潜在的安全漏洞，会导致用户受到“特洛伊木马”类型的攻击。例如一个变量的设置使得Emacs的工作不正常；或者一个eval有一些不可预知的副作用，例如删除文件或者使用你的名字伪造邮件。而攻击者只要引诱你访问一个在局部变量列表中包含这些设置的文件就可以了。只要你访问了这个文件，这些代码就会被执行。<br />
</p>

<p>
保护你自己的方式是将<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> enable-local-variables 'query<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
加入到你的.emacs文件里。这将会使Emacs在执行任何局部变量列表时都会询问你。也可以使用enable-local-eval来控制伪变量eval的执行。<br />
</p>

<p>
<a id="orge569989"></a>[22]. “文件的尾部”的意思是：文件的最后3000个字节&#x2013;是的，这很随意&#x2013;直到最后一行以CONTROL-L开头的行，如果存在的话。<br />
</p>
</div>
</div>
</div>
</body>
</html>
